Vladimir-Trufanov/Probatv/ESP32-CamRecorder/CameraServer.h
/** Arduino, ESP32, C/C++ ********************************** CameraServer.h ***
 * 
 *                                           Обслужить Html-server видео-камеры
 *                                                     
 * v1.0.0, 29.01.2026                                 Автор:      Труфанов В.Е.
 * Copyright © 2026 tve                               Дата создания: 29.01.2026
 * 
**/

#pragma once 

#ifdef ESP8266
  #include <ESP8266WiFi.h>
  #include <ESP8266WebServer.h>
#endif

#ifdef ESP32
  #include <WiFi.h>
  #include <WebServer.h>
#endif

#include <HTTPClient.h>
#include "lwip/sockets.h"
#include <lwip/netdb.h>
#include <ArduinoOTA.h>

#include "inimem.h"
#include "sd.h"

char ssidota[20];
bool do_the_ota = false;

// Определяем экземпляры HTTP-серверов. 
// Тип httpd_handle_t используется для создания и управления веб-серверами и
// возвращается функцией httpd_start(). Она создаёт экземпляр HTTP-сервера, 
// выделяет память и ресурсы в зависимости от указанной конфигурации и 
// возвращает указатель на экземпляр. 
httpd_handle_t camera_httpd = NULL;
httpd_handle_t stream81_httpd = NULL;
httpd_handle_t stream82_httpd = NULL;

char the_page[4200];
int previous_capture = 0;
int capture_timer = 0;
int captures = 0;
int total_captures = 0;
int skips = 0;
int extras = 0;

char file_to_read[50];
char file_to_write[50];

// Объявляем функции модуля
void startCameraServer();
void stopCameraServer();
void print_sock(int sock); 
//static esp_err_t delete_handler(httpd_req_t *req); 
static esp_err_t reindex_handler(httpd_req_t *req); 
static esp_err_t edit_handler(httpd_req_t *req); 
static esp_err_t ota_handler(httpd_req_t *req);
static esp_err_t status_handler(httpd_req_t *req); 
static esp_err_t find_handler(httpd_req_t *req); 
static esp_err_t start_handler(httpd_req_t *req); 
static esp_err_t stop_handler(httpd_req_t *req); 
static esp_err_t time_handler(httpd_req_t *req); 
static esp_err_t restart_handler(httpd_req_t *req); 
static esp_err_t reboot_handler(httpd_req_t *req); 
static esp_err_t sphotos_handler(httpd_req_t *req); 
static esp_err_t fphotos_handler(httpd_req_t *req); 
static esp_err_t photos_handler(httpd_req_t *req); 
static esp_err_t capture_handler(httpd_req_t *req); 
static esp_err_t index_handler(httpd_req_t *req); 


long avi_start_time = 0;
long avi_end_time = 0;
int start_record = 0;
int start_record_2nd_opinion = -2;
int start_record_1st_opinion = -1;

long time_in_web1 = 0;
long time_in_web2 = 0;


/*static esp_err_t delete_handler(httpd_req_t *req) 
{
  esp_err_t res = ESP_OK;

  Serial.print("delete_handler, core ");  Serial.print(xPortGetCoreID());
  Serial.print(", priority = "); Serial.println(uxTaskPriorityGet(NULL));


  httpd_resp_send(req, page_html, strlen(page_html));
  delay(100);
  delete_all_files = 1;
  return res;;
  }
*/


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
void print_sock(int sock) 
{
  sockaddr_in6 clientAddr;
  socklen_t addrLen = sizeof(clientAddr);

  int clientFd = sock; //client.getSocket();

  char ip[INET6_ADDRSTRLEN] = {0};

  if (getpeername(clientFd, (struct sockaddr*)&clientAddr, &addrLen) == 0) 
  {
    //inet_ntop(AF_INET, &clientAddr.sin_addr.s_addr, ip, sizeof(ip));
    jpr("family %d ", clientAddr.sin6_family);
    inet_ntop(AF_INET, &clientAddr.sin6_addr.un.u32_addr[3], ip, sizeof(ip));
    jpr("Peer Client IP4: ");
    jpr(ip);
    inet_ntop(AF_INET6, &clientAddr.sin6_addr.un.u32_addr[3], ip, sizeof(ip));
    jpr(", Peer Client IP6: ");
    jpr(ip);
    uint16_t clientPort = ntohs(clientAddr.sin6_port); // Extract port
    jpr(", Client Port: ");
    jprln("%d", clientPort);

  } 
  else 
  {
    Serial.println("Failed to get client address.");
  }

  if (getsockname(clientFd, (struct sockaddr*)&clientAddr, &addrLen) == 0) 
  {
    //inet_ntop(AF_INET, &clientAddr.sin_addr.s_addr, ip, sizeof(ip));
    jpr("family %d ", clientAddr.sin6_family);
    inet_ntop(AF_INET, &clientAddr.sin6_addr.un.u32_addr[3], ip, sizeof(ip));
    jpr("Sock Client IP4: ");
    jpr(ip);
    inet_ntop(AF_INET6, &clientAddr.sin6_addr.un.u32_addr[3], ip, sizeof(ip));
    jpr(", Sock Client IP6: ");
    jpr(ip);
    uint16_t clientPort = ntohs(clientAddr.sin6_port); // Extract port
    jpr(", Client Port: ");
    jprln("%d", clientPort);

  } else {
    Serial.println("Failed to get client address.");
  }
}


static esp_err_t reindex_handler(httpd_req_t *req) 
{
  esp_err_t res = ESP_OK;

  print_mem("reindex_handler");

  char  buf[150];
  size_t buf_len;

  buf_len = httpd_req_get_url_query_len(req) + 1;

  if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
    //Serial.printf("Query => %s\n", buf);
    if (httpd_query_key_value(buf, "o", file_to_read, sizeof(file_to_read)) == ESP_OK) {
      //Serial.printf( "Found URL query parameter => file_to_read=>%s<\n", file_to_read);
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      //Serial.printf("Query => %s\n", buf);
      if (httpd_query_key_value(buf, "n", file_to_write, sizeof(file_to_write)) == ESP_OK) {
        //Serial.printf( "Found URL query parameter => file_to_write=>%s<\n", file_to_write);
      }
    }
  }

  do_the_reindex = true;

  while (!done_the_reindex) {
    delay(1000);
  }
  String x = " {\"status\":\"!!!DONE!!!\" }";
  const char* str = x.c_str();
  httpd_resp_send(req, str,  strlen(str));

  return res;
}


static esp_err_t edit_handler(httpd_req_t *req) 
{
  esp_err_t res = ESP_OK;
  char  buf[120];
  size_t buf_len;
  char  new_res[20];

  print_mem("edit_handler");

  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
    Serial.printf("Query => %s\n", buf);
    char param[32];

    if (httpd_query_key_value(buf, "f", file_to_edit, sizeof(file_to_edit)) == ESP_OK) {
      Serial.printf( "Found URL query parameter => f=>%s<\n", file_to_edit);

    }
  }

  httpd_resp_send(req, edit_html, strlen(edit_html));

  return res;;
}

static esp_err_t ota_handler(httpd_req_t *req) 
{
  esp_err_t res = ESP_OK;

