Vladimir-Trufanov/Probatv/ESP32-CamRecorder/CameraServer.h
    i = i + 1;
    if ( i <= 10 ) {             // 10 frames
      window.setTimeout(loop, timing);
    }
  }
  loop();
  
})
</script><br>
</body>
</html>)rawliteral";

  sprintf(the_page, msg, devname, devname, vernum, strdate );

  httpd_resp_send(req, the_page, strlen(the_page));
  time_in_web1 += (millis() - start);
  return ESP_OK;
}


static esp_err_t photos_handler(httpd_req_t *req) 
{

  long start = millis();

  print_mem("photos_handler");

  const char the_message[] = "Status";

  time(&now);
  const char *strdate = ctime(&now);

  const char msg[] PROGMEM = R"rawliteral(<!doctype html>
<html>
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>%s ESP32-CAM Video Recorder Junior</title>
</head>
<body>
<h1>%s<br>ESP32-CAM Video Recorder Junior %s <br><font color="red">%s</font></h1><br>
 <br>
 One photo every 3 seconds for 30 seconds - roll forward or back - refresh for more live photos
 <br>

<br><div id="image-container"></div>
<script>
document.addEventListener('DOMContentLoaded', function() {
  var c = document.location.origin;
  const ic = document.getElementById('image-container');  
  var i = 1;
  
  var timing = 3000; // time between snapshots for multiple shots

  function loop() {
    ic.insertAdjacentHTML('beforeend','<img src="'+`${c}/capture?_cb=${Date.now()}`+'">')
    ic.insertAdjacentHTML('beforeend','<br>')
    ic.insertAdjacentHTML('beforeend',Date())
    ic.insertAdjacentHTML('beforeend','<br>')

    i = i + 1;
    if ( i <= 10 ) {             // 10 frames
      window.setTimeout(loop, timing);
    }
  }
  loop();
  
})
</script><br>
</body>
</html>)rawliteral";

  sprintf(the_page, msg, devname, devname, vernum, strdate );

  httpd_resp_send(req, the_page, strlen(the_page));
  time_in_web1 += (millis() - start);
  return ESP_OK;
}


static esp_err_t capture_handler(httpd_req_t *req) 
{

  long start = millis();

  camera_fb_t * fb = NULL;
  esp_err_t res = ESP_OK;
  char fname[100];
  int file_number = 0;

  char  buf[120];
  size_t buf_len;

  if (capture_timer + 30000 <  millis() ) {
    if  (frame_cnt < 1000 ) {
      jpr("Total captures %5d, Last 30 sec: captures %d, %0.1f per second, skips %d, extras %d\n", total_captures, captures, 1000.0 * captures / (millis() - capture_timer), skips, extras);

      print_mem("capture");

      int sock = httpd_req_to_sockfd(req);
      jpr("Socket: %d\n", httpd_req_to_sockfd(req));
      print_sock(sock);
    }
    
    captures = 1;
    total_captures++;
    skips = 0;
    extras = 0;
    capture_timer = millis();
  } else {
    captures++;
    total_captures++;
  }

  if (millis() - previous_capture < 50) { // limit captures to 20 per second (50) ... make that 13 per second (75)
    //Serial.printf("s");
    skips++;
    res = httpd_resp_send_408(req); // just let the requests be missed rather than rejecting it //61
  } else {
    previous_capture = millis();
    file_number++;
    sprintf(fname, "inline; filename=capture_%d.jpg", file_number);

    xSemaphoreTake( baton, portMAX_DELAY );

    if (fb_record_time > (millis() - 500)) {
      //Serial.printf("-");
      fb_capture_len = fb_record_len;
      fb_capture_time = fb_record_time;
      memcpy(fb_capture, fb_record,  fb_record_len);  // v59.5
      xSemaphoreGive( baton );
      httpd_resp_set_type(req, "image/jpeg");
      httpd_resp_set_hdr(req, "Content-Disposition", fname);
      res = httpd_resp_send(req, (const char *)fb_capture, fb_capture_len);
    } else {
      xSemaphoreGive( baton );
      fb = esp_camera_fb_get(); //get_good_jpeg();
      extras++;
      //Serial.print("N");
      //Serial.printf("millis %d, fb1 %d, fb2 %d\n", millis(), fb_record_time, fb_streaming_time);
      if (!fb) {
        Serial.println("Photos - Camera Capture Failed");
        res = httpd_resp_send_408(req);
        //res = ESP_FAIL;
        //start_streaming = false;
      } else {
        xSemaphoreTake( baton, portMAX_DELAY );
        fb_capture_len = fb->len;
        fb_capture_time = millis();
        memcpy(fb_capture, fb->buf, fb->len);
        xSemaphoreGive( baton );
        esp_camera_fb_return(fb);
        httpd_resp_set_type(req, "image/jpeg");
        httpd_resp_set_hdr(req, "Content-Disposition", fname);
        res = httpd_resp_send(req, (const char *)fb_capture, fb_capture_len);
      }
    }
  }

  time_in_web1 += (millis() - start);

  return res;
}


//
static esp_err_t index_handler(httpd_req_t *req) 
{

  long start = millis();

  int buf_len;
  char  buf[120];
  int hdr_len ;

  buf_len = httpd_req_get_hdr_value_len(req, "Host") + 1;

  if (httpd_req_get_hdr_value_str(req, "Host", localip, buf_len) == ESP_OK) {
    //Serial.printf( "Found header => Host: %s\n", localip);
  }

  //sprintf(localip, "%s", buf);
  /*
    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1) {
      if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
        Serial.printf("Found URL query => %s", buf);
      }
    }
  */
  print_mem("index_handler");

  const char the_message[] = "Status";

  time(&now);
  const char *strdate = ctime(&now);

  int tot = SD_MMC.totalBytes() / (1024 * 1024);
  int use = SD_MMC.usedBytes() / (1024 * 1024);
  long rssi = WiFi.RSSI();

  //const query = `${baseHost}:8080/e?edit=config.txt`

  const char msg[] PROGMEM = R"rawliteral(<!doctype html>
<html>
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>%s ESP32-CAM Video Recorder Junior</title>
<script>
function initialize() {
   var baseHost = document.location.origin
   const query = `${baseHost}/time?time=`
   const x = new Date();
   var timing = x.getTime() / 1000;
   const query2 = query + String(timing)
   fetch(query2)
      .then(response => {
         console.log(`request to ${query2} finished, status: ${response.status}`)
      })
}   
   </script>
      </head>
       <body onload="initialize()" style="background-color: white">
        
</head>
<body>
<h1>%s<br>ESP32-CAM Video Recorder Junior %s <br><font color="red">%s</font></h1><br>

 Used / Total SD Space <font color="red"> %d MB / %d MB</font>, Rssi %d<br>

 Filename: %s <br>
 Framesize %d, Quality %d, Frame %d <br>
 Record Interval %dms, Stream Interval %dms <br>
 Avg framesize %d, fps %.1f <br>
 Time left in current video %d seconds<br>

 <h3><a href="http://%s/">http://%s/</a></h3>
 Current Frame:<br>
 <img src="http://%s/capture"/> <br>
 First Frame of Current Recording: (see more in File Management section)<br>
 <img src="http://%s/find?f=/%s&n=0"> <br>
 <h3>Streaming</h3>
 <a href="http://%s:81/stream"><button>Stream 81</button></a>
 <a href="http://%s:82/stream"><button>Stream 82</button></a>
 <h3>Series of pictures</h3>
 <a href="http://%s/photos"><button>10 x 3 sec</button> </a>
 <a href="http://%s/fphotos"><button>10 x 1 sec</button></a>
 <a href="http://%s/sphotos"><button>120 x 15 sec</button></a> 
 <h3>Recording is <font color="red"> %s </font> - overrides hardware pin 12 stop/start</h3>
 <a href="http://%s/start"><button>start</button> </a>
 <a href="http://%s/stop"><button>stop</button></a> 
 <h3>File Management</h3>
 <h4>
 <a href="http://%s:%d/e?edit=config2.txt"><button>edit config2.txt </button></a>
 <a href="http://%s:%d"><button>File Manager - download, delete, view videos </button></a> </h4>

 <h4><a href="http://%s/restart"><button>End recording, and start new video (write the index) </button></a></h4>
 <h4><a href="http://%s/reboot"><button>End recording, and reboot (using new settings)</button> </a></h4>
 <br>
SourceCode:  https://github.com/jameszah/ESP32-CAM-Video-Recorder-junior/<br>
One-Click Installer: https://jameszah.github.io/ESP32-CAM-VideoCam/<br>
James Zahary - Dec 8, 2024 -- May 18, 2022<br>
<a href="https://ko-fi.com/jameszah">Free coffee (not AP mode)</a>

