Vladimir-Trufanov/Probatv/ESP32-CamRecorder/CameraServer.h
<br>
</body>
</html>)rawliteral";

  int time_left = (- millis() +  (avi_start_time + avi_length * 1000)) / 1000;
  if (start_record == 0) 
  {
    time_left = 0;
  }

  String stopstart = "Stopped";
  if (start_record) 
  {
    stopstart = "Recording";
  }

  sprintf(the_page, msg, devname, devname, vernum, strdate, use, tot, rssi, avi_file_name,
          framesize, quality, frame_cnt, frame_interval, stream_delay,
          most_recent_avg_framesize, most_recent_fps, time_left, localip,  localip,  localip,  localip, avi_file_name,
          localip, localip, localip, localip, localip, stopstart.c_str(), localip, localip, localip, filemanagerport, localip, filemanagerport,
          localip, localip,  localip  );

  httpd_resp_send(req, the_page, strlen(the_page));

  time_in_web1 += (millis() - start);
  return ESP_OK;
}


//61.3 up
////////////////////////////////

void startCameraServer() 
{
  // Конфигурируем CameraServer 
  //   (httpd_config_t — структура в ESP32, которая используется для конфигурации HTTP-сервера.
  // Эта структура инициализирует сервер, позволяет настраивать приоритет задачи, 
  // размер стека, порты для данных и управления и другие параметры. 
  //   Структура httpd_config_t передаётся в вызов httpd_start — функцию, которая 
  // создаёт экземпляр HTTP-сервера, выделяет ему память и ресурсы в зависимости 
  // от заданной конфигурации. 
  //   Некоторые особенности использования: 
  // - настройка приоритета задачи и размера стека во время создания экземпляра сервера;
  // - указание портов для данных и управления (контрольный порт используется для внутренней сигнализации);
  // - настройка очереди ожидающих соединений (параметр backlog_conn) — помогает 
  // справляться с кратковременными всплесками запросов, не теряя соединения.
  //   Функциональность сервера строится на регистрации URI-обработчиков (httpd_uri_t), 
  // которые сопоставляют конкретные URI и методы HTTP с функциями. Функции-обработчики 
  // получают объект httpd_req_t для доступа к деталям запроса и используют 
  // httpd_resp_send() для отправки ответов. 
  
  // Пример: в этом примере сервер по умолчанию слушает на порту 80 и регистрирует обработчик URI, 
  // который отправляет «Hello, world!» в ответ на запрос GET по пути /hello.
  /*
  void start_server() 
  {
    httpd_handle_t server = NULL; 
    httpd_config_t config = HTTPD_DEFAULT_CONFIG(); 
    httpd_uri_t hello_uri = 
    { 
      .uri      = "/hello", 
      .method   = HTTP_GET, 
      .handler  = hello_get_handler, 
      .user_ctx = NULL
    };
    if (httpd_start(&server, &config) == ESP_OK) 
    { 
      httpd_register_uri_handler(server, &hello_uri);  
    }  
  } 
  
  static esp_err_t hello_get_handler(httpd_req_t *req) 
  {
    const char* resp_str = (const char*) "Hello, world!";
    httpd_resp_send(req, resp_str, strlen(resp_str));
    return ESP_OK;
  }
  */
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 17; //61.3 from 12
  config.stack_size = 4096 + 1024 + 1024 + 1024;
  
  //61 config.enable_so_linger = true;
  //61 config.linger_timeout = 1;
  //61 config.keep_alive_enable = true;
  //config.enable_so_linger = true;
  //61 config.max_open_sockets   = 10;
  //61 config.backlog_conn       = 10; //from def of 5
  //61 config.core_id = 0; // from tskNO_AFFINITY

  // Включаем опцию очистки наименее использующихся соединений (LRU), 
  // если достигается максимальное количество одновременных подключений 
  // клиентов (max_open_sockets). 
  config.lru_purge_enable = true;

  Serial.print("http task prio: "); Serial.println(config.task_priority);

  httpd_uri_t index_uri = 
  {
    .uri       = "/",
    .method    = HTTP_GET,
    .handler   = index_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t capture_uri = 
  {
    .uri       = "/capture",
    .method    = HTTP_GET,
    .handler   = capture_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t photos_uri = 
  {
    .uri       = "/photos",
    .method    = HTTP_GET,
    .handler   = photos_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t fphotos_uri = 
  {
    .uri       = "/fphotos",
    .method    = HTTP_GET,
    .handler   = fphotos_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t sphotos_uri = 
  {
    .uri       = "/sphotos",
    .method    = HTTP_GET,
    .handler   = sphotos_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t reboot_uri = 
  {
    .uri       = "/reboot",
    .method    = HTTP_GET,
    .handler   = reboot_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t restart_uri = 
  {
    .uri       = "/restart",
    .method    = HTTP_GET,
    .handler   = restart_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t time_uri = 
  {
    .uri       = "/time",
    .method    = HTTP_GET,
    .handler   = time_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t start_uri = 
  {
    .uri       = "/start",
    .method    = HTTP_GET,
    .handler   = start_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t stop_uri = 
  {
    .uri       = "/stop",
    .method    = HTTP_GET,
    .handler   = stop_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t find_uri = 
  {
    .uri       = "/find",
    .method    = HTTP_GET,
    .handler   = find_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t status_uri = 
  {
    .uri       = "/status",
    .method    = HTTP_GET,
    .handler   = status_handler,
    .user_ctx  = NULL
  };
  /*61.3
  httpd_uri_t delete_uri = 
  {
    .uri       = "/delete",
    .method    = HTTP_GET,
    .handler   = delete_handler,
    .user_ctx  = NULL
  };
  61.3 */
  httpd_uri_t edit_uri = 
  {
    .uri       = "/edit",
    .method    = HTTP_GET,
    .handler   = edit_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t reindex_uri = 
  {
    .uri       = "/reindex",
    .method    = HTTP_GET,
    .handler   = reindex_handler,
    .user_ctx  = NULL
  };
  httpd_uri_t ota_uri = 
  {
    .uri       = "/ota",
    .method    = HTTP_GET,
    .handler   = ota_handler,
    .user_ctx  = NULL
  };
  if (httpd_start(&camera_httpd, &config) == ESP_OK) 
  {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &photos_uri);
    httpd_register_uri_handler(camera_httpd, &fphotos_uri);
    httpd_register_uri_handler(camera_httpd, &sphotos_uri);
    httpd_register_uri_handler(camera_httpd, &reboot_uri);
    httpd_register_uri_handler(camera_httpd, &restart_uri);
    httpd_register_uri_handler(camera_httpd, &time_uri);
    httpd_register_uri_handler(camera_httpd, &start_uri);
    httpd_register_uri_handler(camera_httpd, &stop_uri);
    httpd_register_uri_handler(camera_httpd, &edit_uri); //61.3 index->camera
    httpd_register_uri_handler(camera_httpd, &find_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &reindex_uri);
    httpd_register_uri_handler(camera_httpd, &ota_uri);
  }
  Serial.println("Camera http started");
}

void stopCameraServer() 
{
  httpd_stop(camera_httpd);
}

// ********************************************************* CameraServer.h ***
